from geopy.distance import geodesic

# 定义省份地址和对应的经纬度
provinces = {
    "沈阳": (41.8057, 123.4315),
    "西安": (34.3416, 108.9402),
    "深圳": (22.5431, 114.0579),
    "杭州": (30.2741, 120.1551),
    "深圳2": (22.5431, 114.0579),
    "北京": (39.9042, 116.4074),
    "成都": (30.5728, 104.0665),
    "杭州2": (30.2741, 120.1551),
    "北京2": (39.9042, 116.4074),
    "深圳3": (22.5431, 114.0579),
    "武汉": (30.5928, 114.2986),
    "北京3": (39.9042, 116.4074),
    "沈阳2": (41.8057, 123.4315),
}

# 上海的经纬度 (31.2304, 121.4737)
# 沈阳：经度 123.4315°E，纬度 41.8057°N
# 西安：经度 108.9402°E，纬度 34.3416°N
# 深圳：经度 114.0579°E，纬度 22.5431°N
# 杭州：经度 120.1551°E，纬度 30.2741°N
# 北京：经度 116.4074°E，纬度 39.9042°N
# 成都：经度 104.0665°E，纬度 30.5728°N
# 武汉：经度 114.2986°E，纬度 30.5928°N
# 天津的经纬度是（39.0842，117.2007）。
# 重庆的经纬度是（29.4316，106.9123）
# 河北的经纬度是（38.0428，114.5149）。
# 山西的经纬度是（37.5731, 112.5535）。
# 河南的经纬度是（34.0000, 113.0000）
# 辽宁的经纬度是（41.9437, 122.5296）。
# 吉林的经纬度是（43.6661, 126.1923）。
# 黑龙江：（47.3566, 128.0474）
# 内蒙古：（43.4682, 114.4156）
# 江苏：（32.0603, 118.7969）
# 山东：（36.0671, 119.2794）
# 安徽：（31.8257, 117.2264）
# 浙江：（29.1590, 119.9575）
# 福建：（26.0789, 117.9874）
# 湖北：（30.9756, 112.2707）
# 湖南：（27.6104, 111.7088）
# 广东：（23.3417, 113.4244）
# 广西：（23.8298, 108.7881）
# 江西：（27.6140, 115.7221）
# 四川：（30.6171, 102.7103）
# 海南：（19.1959, 109.7453）
# 贵州：（26.8154, 106.8748）
# 云南：（24.9740, 101.4870）
# 陕西：（35.8617, 109.0696）
# 甘肃：（36.0614, 103.8343）
# 青海：（36.6232, 101.7801）
# 宁夏：（37.2692, 106.1655）

# mudidi = (23.8298, 108.7881)


mudidis = {
    "江西": (27.6140, 115.7221),
 "四川": (30.6171, 102.7103),
 "海南": (19.1959, 109.7453),
 "贵州": (26.8154, 106.8748),
 "云南": (24.9740, 101.4870),
 "陕西": (35.8617, 109.0696),
 "甘肃": (36.0614, 103.8343),
 "青海": (36.6232, 101.7801),
 "宁夏": (37.2692, 106.1655),
}


for provincename,mudidi in mudidis.items():
    # 计算每个省份与上海的距离
    distances = {}
    for province, coords in provinces.items():
        distance = geodesic(coords, mudidi).kilometers
        distances[province] = distance

    # 按照距离排序
    sorted_provinces = sorted(distances, key=distances.get)

    # 输出排序编号
    index_map = {}
    index = 1
    for province in sorted_provinces:
        index_map[province] = index
        index += 1

    # 按照原来的列表顺序输出排序编号
    original_order_indices = []
    for province in provinces.keys():
        original_order_indices.append(index_map[province])
    print(provincename)
    print(original_order_indices)

